TalhaErennY/DriverSense-H7/Appli/Drivers/Src/stm32h7sxx_eth_net.c
/*
 * stm32h7sxx_eth_net.c
 *
 *  Created on: 12 Haz 2026
 *      Author: talha
 */

#include "stm32h7sxx_eth_net.h"

/******************************************************************************************************
 * 								Private Helper Prototypes
 ******************************************************************************************************/
//Read Functions
static uint16_t ReadU16BE(const uint8_t *pData, uint32_t offset);
static uint16_t ReadU16LE(const uint8_t *pData, uint32_t offset);
static uint32_t ReadU32BE(const uint8_t *pData, uint32_t offset);
static uint32_t ReadU32LE(const uint8_t *pData, uint32_t offset);
static float ReadF32LE(const uint8_t *pData, uint32_t offset);
static float ReadF32BE(const uint8_t *pData, uint32_t offset);

//Write Functions
static void WriteU16BE(uint8_t *pData, uint32_t offset, uint16_t value);
static void WriteU16LE(uint8_t *pData, uint32_t offset, uint16_t value);
static void WriteU32BE(uint8_t *pData, uint32_t offset, uint32_t value);
static void WriteU32LE(uint8_t *pData, uint32_t offset, uint32_t value);

//Checksum Functions
static uint32_t ChecksumAddBuffer(uint32_t sum, const uint8_t *pData, uint32_t len);
static uint16_t FoldChecksum32(uint32_t sum);
static uint8_t IsIPv4HeaderChecksumValid(const uint8_t *pIPHeader, uint32_t IPHeaderLen);
static uint8_t IsUDPChecksumValid(const uint8_t *pIPHeader, uint32_t IPTotalLen, uint32_t IPHeaderLen);

/******************************************************************************************************
 * 								Ethernet Frame Parser Functions
 ******************************************************************************************************/
/****************************************************************************
 * @fn				- ETHNET_GetEtherType
 *
 * @brief			- This function checks and returns the EtherType field of
 * 					  a raw Ethernet II frame
 *
 * @param[in]		- pointer to raw Ethernet frame buffer
 * @param[in]		- raw Ethernet frame length
 * @param[in]		-
 *
 * @return			- EtherType value, 0 if frame is invalid or not Ethernet II
 *
 * @Note			- EtherType is located at byte 12 and byte 13 of the
 * 					  Ethernet frame.
 * 					- If this field is less than 0x0600, the frame is interpreted
 * 					  as IEEE 802.3 length frame and 0 is returned.
 *					-
 *
 */
uint16_t ETHNET_GetEtherType(const uint8_t *pFrame, uint32_t FrameLength){
	uint16_t type_or_len;

	if(pFrame == 0) return 0U;
	if(FrameLength < ETHNET_HEADER_LEN) return 0U;

	type_or_len = ReadU16BE(pFrame, ETHNET_TYPE_OFFSET);

	if(type_or_len < ETHNET_FRAME_TYPE_MIN){
		//IEEE 802.3 Length frame
		return 0U;
	}

	return type_or_len;
}

/****************************************************************************
 * @fn				- ETHNET_ParseEthernetFrame
 *
 * @brief			- This function parses Ethernet II / IEEE 802.3 frame header
 *
 * @param[in]		- pointer to raw Ethernet frame buffer
 * @param[in]		- raw Ethernet frame length
 * @param[in]		- pointer to parsed Ethernet frame structure
 *
 * @return			- 1 if frame header is valid, 0 otherwise
 *
 * @Note			- For Ethernet II frames, pOut->ethertype contains real EtherType.
 * 					- For IEEE 802.3 frames, pOut->type_or_len contains payload length
 * 					  and pOut->ethertype is 0.
 *					-
 *
 */
uint8_t ETHNET_ParseEthernetFrame(const uint8_t *pFrame, uint32_t FrameLength, ETHNET_Frame_t* pOut){
	uint16_t type_or_len;

	if((pFrame == 0) || (pOut == 0)) return 0U;
	if(FrameLength < ETHNET_HEADER_LEN) return 0U;

	type_or_len = ReadU16BE(pFrame, ETHNET_TYPE_OFFSET);

	pOut->frame 	= pFrame;
	pOut->frame_len = FrameLength;

	pOut->dst_mac	= &pFrame[ETHNET_DST_MAC_OFFSET];
	pOut->src_mac	= &pFrame[ETHNET_SRC_MAC_OFFSET];

	pOut->type_or_len  = type_or_len;
	pOut->ethertype    = 0U;
	pOut->frame_format = ETHNET_FRAME_UNKNOWN;

	pOut->payload     = &pFrame[ETHNET_HEADER_LEN];
	pOut->payload_len = FrameLength - ETHNET_HEADER_LEN;

	if(type_or_len >= ETHNET_FRAME_TYPE_MIN){
		//Ethernet II Frame
		pOut->frame_format = ETHNET_FRAME_ETHERNET_II;
		pOut->ethertype    = type_or_len;
	} else if(type_or_len <= ETHNET_8023_MAX_LEN){
		//IEEE 802.3 Frame
		pOut->frame_format = ETHNET_FRAME_IEEE_802_3;

		//Length check
		if(type_or_len > pOut->payload_len) return 0U;

		pOut->payload_len = type_or_len;
	} else{
		return 0U;
	}

	return 1U;
}

/******************************************************************************************************
 * 								UDP / IPv4 Functions
 ******************************************************************************************************/
/****************************************************************************
 * @fn				- ETHNET_GetUDPPayload
 *
 * @brief			- This function extracts UDP payload pointer and payload
 * 					  length from a raw Ethernet frame
 *
 * @param[in]		- pointer to raw Ethernet frame buffer
 * @param[in]		- raw Ethernet frame length
 * @param[in]		- expected UDP destination port
 * @param[in]		- pointer to payload pointer variable
 * @param[in]		- pointer to payload length variable
 *
 * @return			- 1 if valid UDP payload is found, 0 otherwise
 *
 * @Note			- This function checks Ethernet II, IPv4, IPv4 checksum,
 * 					  UDP protocol, UDP destination port, UDP length and
 * 					  UDP checksum.
 * 					- In IPv4, UDP checksum value 0x0000 means checksum disabled.
 *					- UDP payload is not null-terminated.
 *
 */
uint8_t ETHNET_GetUDPPayload(const uint8_t* pFrame, uint32_t FrameLength, uint16_t ExpectedPort, const uint8_t **ppPayload, uint32_t *pPayloadLength){
	uint16_t ethertype;

	uint32_t ip_offset;
	uint16_t ip_total_len;
	uint8_t  ip_header_len;
	uint8_t  ip_version;
	uint8_t  ip_protocol;

	uint32_t udp_header_offset;
	uint32_t udp_payload_offset;
	uint16_t udp_dest_port;
	uint16_t udp_len;

	if((pFrame == 0) || (ppPayload == 0) || (pPayloadLength == 0)) return 0U;

	*ppPayload = 0;
	*pPayloadLength = 0;

	/*
	 * Check Ethernet Frame Type
	 */
	ethertype = ETHNET_GetEtherType(pFrame, FrameLength);

	if(ethertype != ETHNET_ETHERTYPE_IPV4) return 0U;

