TalhaErennY/DriverSense-H7/Appli/Drivers/Src/stm32h7sxx_eth_net.c
	/*
	 * Minimum Ethernet + IPv4 + UDP Header Length Check
	 */
	if(FrameLength < (ETHNET_IPV4_MIN_HEADER_LEN + ETHNET_UDP_HEADER_LEN + ETHNET_HEADER_LEN)) return 0U;

	/*
	 * IPv4 Header starts after Ethernet header
	 */
	ip_offset = ETHNET_HEADER_LEN;

	/*
	 * IPv4 header starts after Ethernet header.
	 * pFrame[14] example:
	 * 0x45 -> Version = 4, IHL = 5
	 */
	ip_version 		= (uint8_t)(pFrame[ip_offset + ETHNET_IPV4_VER_IHL_OFFSET] >> 4U);		   	// Upper 4 bits show the version
	ip_header_len 	= (uint8_t)((pFrame[ip_offset + ETHNET_IPV4_VER_IHL_OFFSET] & 0x0FU) * 4U); 	// This shows how many 32-bit word exists

	//Checks
	if(ip_version != 4U) return 0U;
	if(ip_header_len < ETHNET_IPV4_MIN_HEADER_LEN) return 0U;
	if(FrameLength < (ETHNET_HEADER_LEN + ip_header_len + ETHNET_UDP_HEADER_LEN)) return 0U;

	/*
	 * IPv4 Total len check
	 */
	ip_total_len = ReadU16BE(pFrame, (ip_offset + ETHNET_IPV4_TOTAL_LEN_OFFSET));
	if(ip_total_len < (ip_header_len + ETHNET_UDP_HEADER_LEN)) return 0U;
	if((ETHNET_HEADER_LEN + (uint32_t)ip_total_len) > FrameLength) return 0U;

	/*
	 * IPv4 Header Checksum Validation
	 */
	if(IsIPv4HeaderChecksumValid(&pFrame[ip_offset], ip_header_len) == 0U) return 0U;

	/*
	 * IPv4 protocol field is at offset 9 inside IPv4 header
	 * UDP = 17
	 */
	ip_protocol = (uint8_t)(pFrame[ip_offset + ETHNET_IPV4_PROTOCOL_OFFSET]);

	if(ip_protocol != ETHNET_IPV4_PROTOCOL_UDP) return 0U;

	/*
	 * UDP Header starts after Ethernet Header + IPv4 Header
	 */
	udp_header_offset = ip_offset + ip_header_len;

	/*
	 * UDP Destiantion port is byte 2-3 inside UDP Header
	 *
	 * Since the UDP data is being written in Big Endian use Read16BE function
	 */
	udp_dest_port = ReadU16BE(pFrame, udp_header_offset + ETHNET_UDP_DST_PORT_OFFSET);

	if(udp_dest_port != ExpectedPort) return 0U;

	/*
	 * UDP Length is byte 4-5 inside UDP header
	 *
	 * Header + Payload
	 */
	udp_len = ReadU16BE(pFrame, udp_header_offset + ETHNET_UDP_LEN_OFFSET);

	if(udp_len < ETHNET_UDP_HEADER_LEN) return 0U;

	/*
	 * Dup packet must fit inside IPv4 Packet
	 */
	if((ip_header_len + udp_len) > ip_total_len) return 0U;

	/*
	 * UDP CheckSum Validation
	 *
	 * if IPv4 UDP Checksum is 0, it is disabled
	 * if not zero, pseudo-header checksum validation is performed (see UDPPSE macros)
	 */
	if(IsUDPChecksumValid(&pFrame[ip_offset], ip_total_len, ip_header_len) == 0U) return 0U;

	udp_payload_offset = udp_header_offset + ETHNET_UDP_HEADER_LEN;

	/*
	 * Overflow check
	 */
	if((udp_payload_offset + (uint32_t)(udp_len - ETHNET_UDP_HEADER_LEN)) > FrameLength) return 0U;

	*ppPayload      = &pFrame[udp_payload_offset];
	*pPayloadLength = (uint32_t)(udp_len - ETHNET_UDP_HEADER_LEN);

	return 1U;
}

/****************************************************************************
 * @fn				- ETHNET_ParseARPPacket
 *
 * @brief			- This parses the incoming ARP Packet
 *
 * @param[in]		- Pointer variable for payload
 * @param[in]		- Payload length
 * @param[in]		- ETHNET ARP_PACK
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 * 					-
 *					-
 *
 */
uint8_t ETHNET_ParseARPPacket(const uint8_t *pPayload, uint32_t PayloadLen, ETHNET_ARP_Packet_t *pARP){
	//Pre-flight checks
	if((pPayload == 0) || pARP == 0) return 0U;
	if(PayloadLen < ETHNET_ARP_PACKET_LEN) return 0U;

	pARP->htype = ReadU16BE(pPayload, ETHNET_ARP_HTYPE_OFFSET);
	pARP->ptype = ReadU16BE(pPayload, ETHNET_ARP_PTYPE_OFFSET);
	pARP->hlen  = pPayload[ETHNET_ARP_HLEN_OFFSET];
	pARP->plen  = pPayload[ETHNET_ARP_PLEN_OFFSET];
	pARP->oper  = ReadU16BE(pPayload, ETHNET_ARP_OPER_OFFSET);

	/*
	 * This parser currently supports only Ethnernet + IPv4 ARP
	 */
	if(pARP->htype != ETHNET_ARP_HTYPE_ETHERNET) return 0U;
	if(pARP->ptype != ETHNET_ARP_PTYPE_IPV4) return 0U;
	if(pARP->hlen  != ETHNET_ARP_HLEN_ETHERNET) return 0U;
	if(pARP->plen  != ETHNET_ARP_PLEN_IPV4) return 0U;

	pARP->sender_mac = &pPayload[ETHNET_ARP_SHA_OFFSET];
	pARP->sender_ip	 = &pPayload[ETHNET_ARP_SPA_OFFSET];
	pARP->target_mac = &pPayload[ETHNET_ARP_THA_OFFSET];
	pARP->target_ip  = &pPayload[ETHNET_ARP_TPA_OFFSET];

	return 1U;
}

/****************************************************************************
 * @fn				- ETHNET_IsARPRequestForIP
 *
 * @brief			-
 *
 * @param[in]		- Pointer variable for payload
 * @param[in]		- Payload length
 * @param[in]		- ETHNET ARP_PACK
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 * 					-
 *					-
 *
 */
uint8_t ETHNET_IsARPRequestForIP(const ETHNET_ARP_Packet_t *pARP, const uint8_t ip[4]){
	if((pARP == 0) || (ip == 0)) return 0U;
	if(pARP->oper != ETHNET_ARP_OPER_REQUEST) return 0U;
	if(pARP->target_ip == 0) return 0U;

	if((pARP->target_ip[0] == ip[0]) && (pARP->target_ip[1] == ip[1]) &&
	   (pARP->target_ip[2] == ip[2]) && (pARP->target_ip[3] == ip[3])) {
		return 1U;
	}

	return 0U;

}

/****************************************************************************
 * @fn				- ETHNET_BuildARPReply
 *
 * @brief			- This function builds an Ethernet II ARP reply frame
 *
 * @param[in]		- pointer to output Ethernet frame buffer
 * @param[in]		- STM32 MAC address
 * @param[in]		- STM32 IPv4 address
 * @param[in]		- parsed ARP request packet
 *
 * @return			- ARP reply Ethernet frame length, 0 if build fails
 *
 * @Note			- This function only builds Ethernet + IPv4 ARP reply.
 * 					- Returned frame length is 60 bytes because Ethernet minimum
 * 					  frame length without FCS is 60 bytes.
 *					- FCS/CRC is added by Ethernet MAC hardware.
 *
 */
uint32_t ETHNET_BuildARPReply(uint8_t *pOutFrame, const uint8_t myMAC[ETHNET_MAC_ADDR_LEN], const uint8_t myIP[ETHNET_IPV4_ADDR_LEN], const ETHNET_ARP_Packet_t *pRequest){
	uint32_t arp_offset;

	if((pOutFrame == 0U) || (myMAC == 0U) || (myIP == 0U) || (pRequest == 0U)) return 0U;

	if(pRequest->sender_mac == 0U) return 0U;
	if(pRequest->sender_ip == 0U) return 0U;

	/*
	 * Clear Minimum Ethernet Area
	 */
	for(uint32_t i = 0U; i < 60U; i++){
		pOutFrame[i] = 0;
	}

	/*
	 * Ethernet II header
	 *
	 * Destination MAC = ARP request sender MAC
	 * Source MAC      = STM32 MAC
	 * EtherType       = ARP, 0x0806
	 */
	for(uint32_t i = 0U; i < ETHNET_MAC_ADDR_LEN; i++){
		pOutFrame[ETHNET_DST_MAC_OFFSET + i] = pRequest->sender_mac[i];
		pOutFrame[ETHNET_SRC_MAC_OFFSET + i] = myMAC[i];
	}

