TalhaErennY/DriverSense-H7/Appli/Drivers/Src/stm32h7sxx_eth_net.c
	return reply_len;
}

/****************************************************************************
 * @fn				- ETHNET_IsIPv4PacketForIP
 *
 * @brief			- This function checks whether an Ethernet frame contains
 * 					  an IPv4 packet addressed to the given IPv4 address
 *
 * @param[in]		- pointer to raw Ethernet frame buffer
 * @param[in]		- raw Ethernet frame length
 * @param[in]		- local IPv4 address
 *
 * @return			- 1 if IPv4 destination address matches, 0 otherwise
 *
 * @Note			- This function checks only Ethernet II + IPv4 destination IP.
 * 					- IPv4 checksum validation can be added separately.
 *					-
 *
 */
uint8_t ETHNET_IsIPv4PacketForIP(const uint8_t *pFrame, uint32_t FrameLen, const uint8_t ip[ETHNET_IPV4_ADDR_LEN]){
	uint16_t ethertype;
	uint8_t ip_ver;
	uint8_t ip_header_len;
	uint32_t ip_offset;

	if((pFrame == 0U) || (FrameLen == 0U) || (ip == 0U)) return 0U;
	if(FrameLen < (ETHNET_HEADER_LEN + ETHNET_IPV4_MIN_HEADER_LEN)) return 0U;

	ethertype = ETHNET_GetEtherType(pFrame, FrameLen);

	if(ethertype != ETHNET_ETHERTYPE_IPV4) return 0U;

	ip_offset = ETHNET_HEADER_LEN;

	ip_ver = (uint8_t)(pFrame[ip_offset + ETHNET_IPV4_VER_IHL_OFFSET] >> 4U);
	ip_header_len = (uint8_t)((pFrame[ip_offset + ETHNET_IPV4_VER_IHL_OFFSET] & 0x0FU) * 4U);

	if(ip_ver != 4U) return 0U;
	if(ip_header_len < ETHNET_IPV4_MIN_HEADER_LEN) return 0U;
	if(FrameLen < (ETHNET_HEADER_LEN + ip_header_len)) return 0U;

	for(uint8_t i = 0U; i < ETHNET_IPV4_ADDR_LEN; i++){
		if(pFrame[ip_offset + ETHNET_IPV4_DST_ADDR_OFFSET + i] != ip[i]){
			return 0U;
		}
	}

	return 1U;

}

/****************************************************************************
 * @fn				- ETHNET_CalcCheckSum16
 *
 * @brief			- This function calculates the standard 16-bit one's
 * 					  complement checksum
 *
 * @param[in]		- pointer to input data buffer
 * @param[in]		- data length in bytes
 * @param[in]		-
 *
 * @return			- calculated 16-bit checksum value
 *
 * @Note			- This checksum is used by IPv4 header and ICMP packets.
 * 					- Checksum field must be cleared before calculation.
 *					- Data is interpreted as big-endian 16-bit words.
 *
 */
uint16_t ETHNET_CalcCheckSum16(const uint8_t *pData, uint32_t Len){
	uint32_t sum;

	if((pData == 0U) || (Len == 0U)) return 0U;

	sum = 0U;
	sum = ChecksumAddBuffer(sum, pData, Len);

	return FoldChecksum32(sum);
}

/******************************************************************************************************
 * 								MAC Helper Functions
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETHNET_IsBroadcastMAC
 *
 * @brief			- This function checks whether given MAC address is broadcast MAC
 *
 * @param[in]		- pointer to MAC address
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 1 if MAC address is FF:FF:FF:FF:FF:FF, 0 otherwise
 *
 * @Note			- none
 *
 */
uint8_t ETHNET_IsBroadcastMAC(const uint8_t *pMAC){
	if(pMAC == 0) return 0U;

	for(uint8_t i = 0U; i < ETHNET_MAC_ADDR_LEN; i++){
		if(pMAC[i] != 0xFFU){
			return 0U;
		}
	}

	return 1U;
}

/****************************************************************************
 * @fn				- ETHNET_IsSameMAC
 *
 * @brief			- This function compares two MAC addresses
 *
 * @param[in]		- pointer to first MAC address
 * @param[in]		- pointer to second MAC address
 * @param[in]		-
 *
 * @return			- 1 if MAC addresses are same, 0 otherwise
 *
 * @Note			- none
 *
 */
uint8_t ETHNET_IsSameMAC(const uint8_t *pMAC1, const uint8_t *pMAC2){
	if((pMAC1 == 0) || (pMAC2 == 0)) return 0U;

	for(uint8_t i = 0U; i < ETHNET_MAC_ADDR_LEN; i++){
		if(pMAC1[i] != pMAC2[i]) return 0U;
	}

	return 1U;
}

/******************************************************************************************************
 * 								Checksum Helper Functions
 ******************************************************************************************************/
/****************************************************************************
 * @fn				- ChecksumAddBuffer
 *
 * @brief			- This internal helper adds a byte buffer to a 32-bit
 * 					  one's complement checksum accumulator
 *
 * @param[in]		- current checksum sum
 * @param[in]		- pointer to input data buffer
 * @param[in]		- data length in bytes
 *
 * @return			- updated 32-bit checksum sum
 *
 * @Note			- Data is interpreted as big-endian 16-bit words.
 * 					- If length is odd, the last byte is padded with zero.
 *					- This function is private to this file.
 *
 */
static uint32_t ChecksumAddBuffer(uint32_t sum, const uint8_t *pData, uint32_t len){
	uint16_t word;

	if(pData == 0U) return sum;

	while(len > 1U){
		word = ((uint16_t)pData[0U] << 8U) | ((uint16_t)pData[1U]);
		sum += word;

		pData += 2U;
		len -= 2U;
	}

	if(len > 0){
		word = ((uint16_t)pData[0U] << 8U);
		sum += word;
	}

	return sum;
}

/****************************************************************************
 * @fn				- FoldChecksum32
 *
 * @brief			- This internal helper folds a 32-bit checksum sum into
 * 					  a 16-bit one's complement checksum value
 *
 * @param[in]		- 32-bit checksum sum
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 16-bit one's complement checksum value
 *
 * @Note			- This function is private to this file.
 * 					- It is used by IPv4, ICMP and UDP checksum calculations.
 *					-
 *
 */
static uint16_t FoldChecksum32(uint32_t sum){
	while((sum >> 16U) != 0U){
		sum = (sum & 0xFFFFU) + (sum >> 16U);
	}

	return (uint16_t)(~sum);
}

/****************************************************************************
 * @fn				- IsIPv4HeaderChecksumValid
 *
 * @brief			- This internal helper validates IPv4 header checksum
 *
 * @param[in]		- pointer to IPv4 header
 * @param[in]		- IPv4 header length in bytes
 * @param[in]		-
 *
 * @return			- 1 if IPv4 header checksum is valid, 0 otherwise
 *
 * @Note			- IPv4 header checksum includes the checksum field itself.
 * 					- If the header is valid, calculated checksum result is 0.
 *					- This function is private to this file.
 *
 */
static uint8_t IsIPv4HeaderChecksumValid(const uint8_t *pIPHeader, uint32_t IPHeaderLen){
	if(pIPHeader == 0U) return 0U;
	if(IPHeaderLen < ETHNET_IPV4_MIN_HEADER_LEN) return 0U;

