TalhaErennY/DriverSense-H7/Appli/Drivers/Src/stm32h7sxx_eth_net.c
	if(ETHNET_CalcCheckSum16(pIPHeader, IPHeaderLen) == 0U) return 1U;

	return 0U;
}

/****************************************************************************
 * @fn				- IsUDPChecksumValid
 *
 * @brief			- This internal helper validates UDP checksum using IPv4
 * 					  pseudo-header
 *
 * @param[in]		- pointer to IPv4 header
 * @param[in]		- IPv4 total length
 * @param[in]		- IPv4 header length
 *
 * @return			- 1 if UDP checksum is valid or disabled, 0 otherwise
 *
 * @Note			- In IPv4, UDP checksum value 0x0000 means checksum disabled.
 * 					- If UDP checksum is not zero, IPv4 pseudo-header is used.
 *					- Pseudo-header is not transmitted on the wire.
 *					- This function is private to this file.
 *
 */
static uint8_t IsUDPChecksumValid(const uint8_t *pIPHeader, uint32_t IPTotalLen, uint32_t IPHeaderLen){
	const uint8_t *pUDP;

	uint32_t sum;
	uint32_t udp_len;
	uint32_t udp_data_len;

	uint16_t udp_checksum;

	if(pIPHeader == 0U) return 0U;
	if(IPHeaderLen < ETHNET_IPV4_MIN_HEADER_LEN) return 0U;
	if(IPTotalLen < (IPHeaderLen + ETHNET_UDP_HEADER_LEN)) return 0U;

	/*
	 * UDP Header starts after IPv4 header
	 */
	pUDP = &pIPHeader[IPHeaderLen];

	/*
	 * UDP Len
	 */
	udp_len = (uint32_t)ReadU16BE(pUDP, ETHNET_UDP_LEN_OFFSET);

	if(udp_len < ETHNET_UDP_HEADER_LEN) return 0U;
	if((IPHeaderLen + udp_len) > IPTotalLen) return 0U;

	/*
	 * UDP Checksum field
	 */
	udp_checksum = ReadU16BE(pUDP, ETHNET_UDP_CKSUM_OFFSET);

	/*
	 * If 0x0000,  UDP checksum disabled
	 */
	if(udp_checksum == 0U) return 1U;

	sum = 0U;

	/*
	 * IPv4 Pseudo Headers
	 */
	sum += ReadU16BE(pIPHeader, ETHNET_IPV4_SRC_ADDR_OFFSET + 0U);
	sum += ReadU16BE(pIPHeader, ETHNET_IPV4_SRC_ADDR_OFFSET + 2U);

	sum += ReadU16BE(pIPHeader, ETHNET_IPV4_DST_ADDR_OFFSET + 0U);
	sum += ReadU16BE(pIPHeader, ETHNET_IPV4_DST_ADDR_OFFSET + 2U);

	sum += (uint16_t)ETHNET_IPV4_PROTOCOL_UDP;
	sum += (uint16_t)udp_len;

	/*
	 * UDP Header + UDP payload are added including cheksum field
	 */
	udp_data_len = udp_len;
	sum = ChecksumAddBuffer(sum, pUDP, udp_data_len);

	/*
	 * If checksum valid, final one's compelemtn result becomes 0x0000
	 */
	if(FoldChecksum32(sum) == 0U) return 1U;

	return 0U;
}




/******************************************************************************************************
 * 								Private Helper Functions
 ******************************************************************************************************/
/*
 * Read 16-bit big-endian unsigned value from byte buffer.
 */
static uint16_t ReadU16BE(const uint8_t *pData, uint32_t offset){
	return ((uint16_t)pData[offset] << 8U) | ((uint16_t)pData[offset + 1U]);
}

/*
 * Read 16-bit little-endian unsigned value from byte buffer.
 */
static uint16_t ReadU16LE(const uint8_t *pData, uint32_t offset){
	return ((uint16_t)pData[offset + 1U] << 8U) | ((uint16_t)pData[offset]);
}

/*
 * Read 32-bit big-endian unsigned value from byte buffer.
 */
static uint32_t ReadU32BE(const uint8_t *pData, uint32_t offset){
	return ((uint32_t)pData[offset] << 24U) 	 |
			((uint32_t)pData[offset + 1U] << 16U)|
			((uint32_t)pData[offset + 2U] << 8U) |
			((uint32_t)pData[offset + 3U]);

}

/*
 * Read 32-bit little-endian unsigned value from byte buffer.
 */
static uint32_t ReadU32LE(const uint8_t *pData, uint32_t offset){
	return ((uint32_t)pData[offset]) 			 |
		   ((uint32_t)pData[offset + 1U] << 8U)  |
		   ((uint32_t)pData[offset + 2U] << 16U) |
		   ((uint32_t)pData[offset + 3U] << 24U);
}

/*
 * Read 32-bit little-endian float value from byte buffer.
 *
 * <!Enable FPU before using this function.>
 */
static float ReadF32LE(const uint8_t *pData, uint32_t offset){
	union{
		uint32_t u32;
		float f32;
	} value;

	value.u32 = ReadU32LE(pData, offset);

	return value.f32;
}

/*
 * Read 32-bit big-endian float value from byte buffer.
 *
 * <!Enable FPU before using this function.>
 */
static float ReadF32BE(const uint8_t *pData, uint32_t offset){
	union{
		uint32_t u32;
		float f32;
	} value;

	value.u32 = ReadU32BE(pData, offset);

	return value.f32;
}

/*
 * Write 16-bit big-endian unsigned value to byte buffer.
 */
static void WriteU16BE(uint8_t *pData, uint32_t offset, uint16_t value){
	pData[offset]		= (uint8_t)(value >> 8U);
	pData[offset + 1U]	= (uint8_t)(value);
}

/*
 * Write 16-bit little-endian unsigned value to byte buffer.
 */
static void WriteU16LE(uint8_t *pData, uint32_t offset, uint16_t value){
	pData[offset]		= (uint8_t)(value);
	pData[offset + 1U]	= (uint8_t)(value >> 8U);
}

/*
 * Write 32-bit big-endian unsigned value to byte buffer.
 */
static void WriteU32BE(uint8_t *pData, uint32_t offset, uint32_t value){
	pData[offset]		= (uint8_t)(value >> 24U);
	pData[offset + 1U]	= (uint8_t)(value >> 16U);
	pData[offset + 2U]	= (uint8_t)(value >> 8U);
	pData[offset + 3U]	= (uint8_t)(value);
}

/*
 * Write 32-bit little-endian unsigned value to byte buffer.
 */
static void WriteU32LE(uint8_t *pData, uint32_t offset, uint32_t value){
	pData[offset]		= (uint8_t)(value);
	pData[offset + 1U]	= (uint8_t)(value >> 8U);
	pData[offset + 2U]	= (uint8_t)(value >> 16U);
	pData[offset + 3U]	= (uint8_t)(value >> 24U);
}
